Revit 2027 API
PanelScheduleData.UpdateCircuitTableForInstance Method
 Redraw the circuit table for the given panel with the given parameter updates
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateCircuitTableForInstance(
	FamilyInstance pPanel
)
Public Sub UpdateCircuitTableForInstance (
	pPanel As FamilyInstance
)
public:
void UpdateCircuitTableForInstance(
	FamilyInstance^ pPanel
)
member UpdateCircuitTableForInstance :
        pPanel : FamilyInstance -> unit
Parameters
pPanel FamilyInstance
 The panel that this circuit table is being drawn for
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace